# `.dropna()` to drop NULL values

### Import Pandas

In [1]:
# import pandas
import pandas as pd
from pathlib import Path

### U.S. Major League Soccer Salaries

In [3]:
path = Path('C:/Users/alouden01/Documents/python-pandas-for-data-manipulation/starter_files/skill_07_dataframe_null_values/mls_salaries.csv')
salaries = pd.read_csv(path)
salaries.head()

  club last_name first_name position  base_salary  guaranteed_compensation
0  ATL   Almiron     Miguel        M    1912500.0               2297000.00
1  ATL   Ambrose      Mikey        D      65625.0                 65625.00
2  ATL      Asad      Yamil        M     150000.0                150000.00
3  ATL     Bloom       Mark        D      99225.0                106573.89
4  ATL  Carleton     Andrew        F      65000.0                 77400.00

### Remove NaN values

In [4]:
# return the DataFrame
salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 615 entries, 0 to 614
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   club                     614 non-null    object
 1   last_name                614 non-null    object
 2   first_name               610 non-null    object
 3   position                 604 non-null    object
 4   base_salary              614 non-null    float64
 5   guaranteed_compensation  614 non-null    float64
dtypes: float64(2), object(4)
memory usage: 29.0+ KB

### Return information about the DataFrame including Non_Null Count

### Drop any rows with missing values

In [22]:
# drop any row that contains a NaN value by default (how='any')
s: pd.DataFrame = salaries.dropna(how='any')
import os
os.getcwd()

'c:\\Users\\alouden01\\Documents\\python-pandas-for-data-manipulation'

### Return information about the DataFrame including Non_Null Count

### Return DataFrame without null values

In [ ]:
# return the DataFrame with no NaN values
salaries.dropna(subset=['first_name','position'],inplace=True)
salaries.info()

<class 'pandas.core.frame.DataFrame'>
Index: 600 entries, 0 to 614
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   club                     600 non-null    object
 1   last_name                600 non-null    object
 2   first_name               600 non-null    object
 3   position                 600 non-null    object
 4   base_salary              600 non-null    float64
 5   guaranteed_compensation  600 non-null    float64
dtypes: float64(2), object(4)
memory usage: 32.8+ KB

### Reset dataset

In [26]:
# reset by re-reading original dataset
salaries = pd.read_csv(path)
salaries.tail()

    club last_name first_name position  base_salary  guaranteed_compensation
610  VAN   Teibert    Russell        M     126500.0                 194000.0
611  VAN  Tornaghi      Paolo       GK      80000.0                  80000.0
612  VAN    Waston    Kendall        D     350000.0                 368125.0
613  NaN       NaN        NaN      NaN          NaN                      NaN
614  VAN  Williams    Sheanon        D     175000.0                 184000.0

### Remove NaN values by column

In [ ]:
# fisrt, return a column as a Series from the DataFrame

In [ ]:
# you can also use a list to specify which columns to target using subset=

In [ ]:
# no NaN values

### Reset dataset

In [ ]:
# reset by re-reading original dataset

In [ ]:
# drop only rows with all null values (how='all')

In [ ]:
# make drop permanent with inplace

In [ ]:
# it is now permanent

### Reset dataset

In [ ]:
# reset by re-reading original dataset

In [ ]:
# drop columns that contain any null values 
# remember (how='any') is the default
# first lets remove the empty fucking row
salaries.dropna(how='all', inplace=True)
#remove the COLUMNS!!!! if they have ANY!!! missing values
salaries.dropna(how='any', axis=1)

    club last_name  base_salary  guaranteed_compensation
0    ATL   Almiron    1912500.0               2297000.00
1    ATL   Ambrose      65625.0                 65625.00
2    ATL      Asad     150000.0                150000.00
3    ATL     Bloom      99225.0                106573.89
4    ATL  Carleton      65000.0                 77400.00
..   ...       ...          ...                      ...
609  VAN   Techera     352000.0                377000.00
610  VAN   Teibert     126500.0                194000.00
611  VAN  Tornaghi      80000.0                 80000.00
612  VAN    Waston     350000.0                368125.00
614  VAN  Williams     175000.0                184000.00

[614 rows x 4 columns]

:

### Reset dataset

In [ ]:
# drop columns with null values in the base_salary column